app/Controllers/AuthController.php

    public function loginHandler()
    {
        $fieldType = filter_var($this->request->getVar('login_id'), FILTER_VALIDATE_EMAIL) ? 'email' : 'username';

        $rules = [
            'login_id' => 'required',
            'password' => 'required|min_length[5]|max_length[45]'
        ];

        $errors = [
            'login_id' => [
                'required' => 'Le nom d\'utilisateur ou l\'email est requis.'
            ],
            'password' => [
                'required' => 'Le mot de passe est requis.',
                'min_length' => 'Le mot de passe doit contenir au moins 5 caractères.',
                'max_length' => 'Le mot de passe ne doit pas dépasser 45 caractères.'
            ]
        ];

        if (!$this->validate($rules, $errors)) {
            return view('backend/pages/auth/login', [
                'pageTitle' => 'login',
                'validation' => $this->validator
            ]);
        }

        // Récupérer l'utilisateur depuis la table admins
        $adminModel = new Admin();
        $admin = $adminModel->where($fieldType, $this->request->getVar('login_id'))->first();
---
SELECT *
FROM `admins`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1