app/Controllers/DemandesController.php

SELECT `emprunt_en_cours`.*, `livres`.`title` AS `book_title`, `livres`.`photo` AS `book_photo`, `utilisateurs`.`name` AS `user_name`, `utilisateurs`.`email` AS `user_email`
FROM `emprunt_en_cours`
JOIN `livres` ON `livres`.`id` = `emprunt_en_cours`.`book_id`
JOIN `utilisateurs` ON `utilisateurs`.`id` = `emprunt_en_cours`.`user_id`
WHERE `status` = 'pending'
---
    public function index()
    {
        $empruntModel = new EmpruntEnCoursModel();
        $userModel = new UserModel();
        $bookModel = new BookModel();

        // Récupérer les emprunts avec le statut "pending" et joindre les informations sur les livres et les utilisateurs
        $emprunts = $empruntModel
            ->select('emprunt_en_cours.*, livres.title AS book_title, livres.photo AS book_photo, utilisateurs.name AS user_name, utilisateurs.email AS user_email')
            ->join('livres', 'livres.id = emprunt_en_cours.book_id')
            ->join('utilisateurs', 'utilisateurs.id = emprunt_en_cours.user_id')
            ->where('status', 'pending')
            ->findAll();

SELECT *
FROM `emprunt_en_cours`
WHERE `emprunt_en_cours`.`id` = '14'
UPDATE `emprunt_en_cours` SET `status` = 'accepted', `updated_at` = '2024-12-06 15:53:17'
WHERE `emprunt_en_cours`.`id` IN ('14')
---
    public function accepter($empruntId)
    {
        $empruntModel = new EmpruntEnCoursModel();
        $userModel = new UserModel();
        $bookModel = new BookModel();

        // Récupérer l'emprunt en cours
        $emprunt = $empruntModel->find($empruntId);
        if (!$emprunt || $emprunt['status'] !== 'pending') {
            return redirect()->to('/demandes')->with('error', 'Demande invalide ou déjà traitée.');
        }

        // Mettre à jour le statut de l'emprunt
        $empruntModel->update($empruntId, ['status' => 'accepted']);