app/Controllers/UserController.php

    public function borrowBook($bookId)
    {
        // Récupérer l'ID de l'utilisateur depuis la session
        $session = session();
        $userId = $session->get('user_id');  // ID de l'utilisateur connecté

        if (!$userId) {
            // Si l'utilisateur n'est pas connecté, renvoyer une erreur
            return $this->response->setJSON(['error' => 'Vous devez être connecté pour emprunter un livre.']);
        }

        // Récupérer les détails du livre
        $bookModel = new BookModel();
        $book = $bookModel->find($bookId);

        if (!$book) {
            // Si le livre n'existe pas, renvoyer une erreur
            return $this->response->setJSON(['error' => 'Livre non trouvé.']);
        }

        // Vérifier si une demande d'emprunt est déjà en cours
        $empruntEnCoursModel = new EmpruntEnCoursModel();
        $existingBorrow = $empruntEnCoursModel->where('user_id', $userId)
                                             ->where('book_id', $bookId)
                                             ->where('status', 'pending')
                                             ->first();
---
SELECT *
FROM `emprunt_en_cours`
WHERE `user_id` = '1'
AND `book_id` = '5'
AND `status` = 'pending'
 LIMIT 1

            'status'  => 'pending',  // Demande en attente
        ];

        if ($empruntEnCoursModel->save($data)) {
---
INSERT INTO `emprunt_en_cours` (`user_id`, `book_id`, `status`, `created_at`, `updated_at`) VALUES ('1', '5', 'pending', '2024-12-06 15:50:26', '2024-12-06 15:50:26')

    public function enAttente()
    {
        $session = session();
        $userId = $session->get('user_id'); // ID de l'utilisateur connecté

        // Récupérer les emprunts en attente avec les informations du livre
        $empruntEnCoursModel = new EmpruntEnCoursModel();
        $empruntsEnAttente = $empruntEnCoursModel
            ->select('emprunt_en_cours.*, livres.photo, livres.title, livres.author') // Utilisation correcte des noms de tables
            ->join('livres', 'livres.id = emprunt_en_cours.book_id') // Jointure avec la table livres
            ->where('emprunt_en_cours.user_id', $userId)
            ->where('emprunt_en_cours.status', 'pending')
            ->findAll();
---
SELECT `emprunt_en_cours`.*, `livres`.`photo`, `livres`.`title`, `livres`.`author`
FROM `emprunt_en_cours`
JOIN `livres` ON `livres`.`id` = `emprunt_en_cours`.`book_id`
WHERE `emprunt_en_cours`.`user_id` = '1'
AND `emprunt_en_cours`.`status` = 'pending'