app/Views/details.php

$session = session();
$userId = $session->get('user_id');
$empruntEnCoursModel = new EmpruntEnCoursModel();
$existingBorrow = $empruntEnCoursModel->where('user_id', $userId)
                                      ->where('book_id', esc($book['id']))
                                      ->where('status', 'pending')
                                      ->first();
---
SELECT *
FROM `emprunt_en_cours`
WHERE `user_id` = '1'
AND `book_id` = '5'
AND `status` = 'pending'
 LIMIT 1